{"id":"56922610-3c02-4335-b964-c0bfbcf753b1","updated_at":"2025-11-02T03:48:11.633Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.633Z","created_by":"elastic","name":"Processes with Trailing Spaces","tags":["Domain: Endpoint","OS: Linux","OS: macOS","Use Case: Threat Detection","Tactic: Defense Evasion","Rule Type: BBR","Data Source: Elastic Defend","Data Source: Elastic Endgame","Data Source: Auditd Manager"],"interval":"60m","enabled":true,"revision":0,"description":"Identify instances where adversaries include trailing space characters to mimic regular files, disguising their activity to evade default file handling mechanisms.","risk_score":21,"severity":"low","building_block_type":"default","license":"Elastic License v2","output_index":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-119m","rule_id":"0c093569-dff9-42b6-87b1-0242d9f7d9b4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/","subtechnique":[{"id":"T1036.006","name":"Space after Filename","reference":"https://attack.mitre.org/techniques/T1036/006/"}]}]}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":true,"rule_source":{"type":"external","is_customized":false},"related_integrations":[{"package":"endpoint","version":"^8.2.0"},{"package":"auditd_manager","version":"^1.0.0"}],"required_fields":[{"name":"event.action","type":"keyword","ecs":true},{"name":"event.type","type":"keyword","ecs":true},{"name":"process.name","type":"keyword","ecs":true}],"setup":"","type":"eql","language":"eql","index":["logs-endpoint.events.*","endgame-*","auditbeat-*","logs-auditd_manager.auditd-*"],"query":"process where event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"executed\", \"process_started\") and\nprocess.name : \"* \"\n","actions":[]}
{"id":"20e89d23-ab75-449c-94a8-816374c4170e","updated_at":"2025-11-02T05:23:00.401Z","updated_by":"elastic","created_at":"2025-11-02T04:51:15.849Z","created_by":"elastic","name":"Process was created","tags":["OS: Windows"],"interval":"1m","enabled":true,"revision":1,"description":"A new process was created","risk_score":25,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"b1725732-896a-4381-81ac-c06fc80bc6f7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204/","subtechnique":[{"id":"T1204.002","name":"Malicious File","reference":"https://attack.mitre.org/techniques/T1204/002/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code:\"1\" and winlog.provider_name: \"Microsoft-Windows-Sysmon\"","filters":[],"actions":[]}
{"id":"976652b2-6f2c-4d43-8f0d-a18e520f2078","updated_at":"2025-11-02T03:48:11.584Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.584Z","created_by":"elastic","name":"Potential Process Name Stomping with Prctl","tags":["Data Source: Auditd Manager","Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Defense Evasion","Resources: Investigation Guide"],"interval":"5m","enabled":true,"revision":0,"description":"This rule leverages Auditd data to detect the use of the `prctl` syscall to potentially hide a process by changing its name. The `prctl` syscall is used to control various process attributes. Attackers can use this syscall to change the name of a process to a hidden directory or file, making it harder to detect. The query looks for the `prctl` syscall with the `PR_SET_NAME` argument set to `f` (PR_SET_NAME is used to set the name of a process).","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Potential Process Name Stomping with Prctl\n\nThe `prctl` syscall in Linux allows processes to modify their attributes, including renaming themselves. This capability can be exploited by attackers to disguise malicious processes, making them harder to identify. The detection rule monitors for `prctl` invocations with specific arguments indicative of name changes, especially when linked to suspicious directories, thus flagging potential evasion attempts.\n\n### Possible investigation steps\n\n- Review the process details associated with the alert, focusing on the executable path to determine if it matches any suspicious directories listed in the query, such as \"/tmp/*\" or \"/var/tmp/*\".\n- Examine the process tree to identify the parent process and any child processes spawned by the suspicious process, which may provide context on how the process was initiated and its potential impact.\n- Check the command line arguments and environment variables of the process to gather additional context on its intended function and any anomalies.\n- Investigate the user account under which the process is running to determine if it aligns with expected behavior or if it indicates potential compromise.\n- Correlate the alert with other security events or logs, such as file modifications or network connections, to identify any related malicious activity or patterns.\n- Assess the historical activity of the process executable and its associated files to determine if this behavior is new or part of a recurring pattern.\n\n### False positive analysis\n\n- System maintenance scripts may invoke prctl to rename processes for legitimate reasons. Review scheduled tasks and maintenance scripts in directories like /etc/cron.* and /etc/init.d to identify benign uses.\n- Development environments often use prctl for testing purposes. Exclude known development directories such as /home/developer or /tmp/dev from the rule to reduce noise.\n- Some monitoring or logging tools might use prctl to rename their processes for clarity. Identify these tools and add their executable paths to an exception list.\n- Custom scripts or applications that manage process names for operational reasons should be documented. Exclude these scripts by specifying their paths in the rule configuration.\n- Regularly review and update the exception list to ensure it reflects the current environment and does not inadvertently exclude new threats.\n\n### Response and remediation\n\n- Immediately isolate the affected system from the network to prevent further malicious activity or lateral movement.\n- Terminate any suspicious processes identified by the detection rule, especially those with altered names in critical directories.\n- Conduct a thorough review of the affected system's process tree and file system to identify any additional signs of compromise or persistence mechanisms.\n- Restore any altered or suspicious files from a known good backup to ensure system integrity.\n- Update and patch the affected system to close any vulnerabilities that may have been exploited by the attacker.\n- Monitor the network for any signs of similar activity or attempts to use the `prctl` syscall with the `PR_SET_NAME` argument in other systems.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if broader organizational impacts exist.","license":"Elastic License v2","output_index":"","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"fef62ecf-0260-4b71-848b-a8624b304828","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/","subtechnique":[{"id":"T1036.005","name":"Match Legitimate Resource Name or Location","reference":"https://attack.mitre.org/techniques/T1036/005/"}]}]}],"to":"now","references":["https://haxrob.net/process-name-stomping/","https://haxrob.net/hiding-in-plain-sight-part-2/","https://www.elastic.co/security-labs/linux-detection-engineering-with-auditd"],"version":5,"exceptions_list":[],"immutable":true,"rule_source":{"type":"external","is_customized":false},"related_integrations":[{"package":"auditd_manager","version":"^1.0.0"}],"required_fields":[{"name":"auditd.data.a0","type":"unknown","ecs":false},{"name":"auditd.data.syscall","type":"unknown","ecs":false},{"name":"host.os.type","type":"keyword","ecs":true},{"name":"process.executable","type":"keyword","ecs":true}],"setup":"## Setup\n\nThis rule requires data coming in from Auditd Manager.\n\n### Auditd Manager Integration Setup\nThe Auditd Manager Integration receives audit events from the Linux Audit Framework which is a part of the Linux kernel.\nAuditd Manager provides a user-friendly interface and automation capabilities for configuring and monitoring system auditing through the auditd daemon. With `auditd_manager`, administrators can easily define audit rules, track system events, and generate comprehensive audit reports, improving overall security and compliance in the system.\n\n#### The following steps should be executed in order to add the Elastic Agent System integration \"auditd_manager\" on a Linux System:\n- Go to the Kibana home page and click “Add integrations”.\n- In the query bar, search for “Auditd Manager” and select the integration to see more details about it.\n- Click “Add Auditd Manager”.\n- Configure the integration name and optionally add a description.\n- Review optional and advanced settings accordingly.\n- Add the newly installed “auditd manager” to an existing or a new agent policy, and deploy the agent on a Linux system from which auditd log files are desirable.\n- Click “Save and Continue”.\n- For more details on the integration refer to the [helper guide](https://docs.elastic.co/integrations/auditd_manager).\n\n#### Rule Specific Setup Note\nAuditd Manager subscribes to the kernel and receives events as they occur without any additional configuration.\nHowever, if more advanced configuration is required to detect specific behavior, audit rules can be added to the integration in either the \"audit rules\" configuration box or the \"auditd rule files\" box by specifying a file to read the audit rules from.\n- For this detection rule the following additional audit rules are required to be added to the integration:\n  -- \"-a exit,always -F arch=b64 -S prctl -k prctl_detection\"\n","type":"eql","language":"eql","index":["logs-auditd_manager.auditd-*","auditbeat-*"],"query":"process where host.os.type == \"linux\" and auditd.data.syscall == \"prctl\" and auditd.data.a0 == \"f\" and\nprocess.executable like (\n  \"/boot/*\", \"/dev/shm/*\", \"/etc/cron.*/*\", \"/etc/init.d/*\", \"/var/run/*\", \"/etc/update-motd.d/*\",\n  \"/tmp/*\", \"/var/log/*\", \"/var/tmp/*\", \"/home/*\", \"/run/shm/*\", \"/run/*\", \"./*\"\n)\n","actions":[]}
{"id":"c126af87-f5d3-4f7d-8b1d-7d9e1cda81b2","updated_at":"2025-11-02T05:21:54.753Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.084Z","created_by":"elastic","name":"Potential Rootkit in Use","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"Someone ran \"kill\" with an invalid signal. This is commonly used to elevate privileges to root","risk_score":75,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"7725d03d-0d73-49f6-a424-d98d84217c64","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1014","name":"Rootkit","reference":"https://attack.mitre.org/techniques/T1014/","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["auditbeat-*"],"query":"process where tags == \"signals\" and not auditd.data.a1 in (\"0\", \"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"a\", \"b\", \"c\", \"d\", \"e\", \"f\", \"10\", \"11\", \"12\", \"13\", \"14\", \"15\", \"16\", \"17\", \"18\", \"19\", \"1a\", \"1b\", \"1c\", \"1d\", \"1e\", \"1f\", \"20\")","filters":[],"actions":[]}
{"id":"95ce90c9-0d07-4669-a3eb-c1d391fa4034","updated_at":"2025-11-02T05:21:54.748Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.102Z","created_by":"elastic","name":"A Pam File was Modified","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"Someone modified a pam file and potentially placed a backdoor","risk_score":75,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"7d64bc86-68e8-45a9-8ae4-e7b0f78fa2ef","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["auditbeat-*"],"query":"file where event.type == \"change\" and file.path like \"/etc/pam.*\" and event.module == \"file_integrity\"","filters":[],"actions":[]}
{"id":"1ad84d86-4501-415e-a4ba-eb25bd9f274e","updated_at":"2025-11-02T05:21:54.750Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.076Z","created_by":"elastic","name":"Potential Process Hiding","tags":["OS: Linux"],"interval":"5m","enabled":true,"revision":1,"description":"The \"/etc/ld.so.preload\" file was modified which may indicate libprocesshider.so was added as a preload module. This can be used to hide processes and is commonly used to hide rootkits.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"3df4f89e-ba52-42cb-a87e-bb3a64748bbe","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1014","name":"Rootkit","reference":"https://attack.mitre.org/techniques/T1014/","subtechnique":[]},{"id":"T1564","name":"Hide Artifacts","reference":"https://attack.mitre.org/techniques/T1564/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.module:\"file_integrity\" and event.type:\"change\" and file.path:\"/etc/ld.so.preload\"","filters":[],"actions":[]}
{"id":"f4edf156-1964-4b93-83b2-5ea59f0669a6","updated_at":"2025-11-02T05:21:54.763Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.107Z","created_by":"elastic","name":"New Kernel Module Loaded","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A potentially malicious new kernel module was loaded. Could be a sign of a rootkit being installed","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"728f2680-911d-4738-b957-e03081e72cc9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1014","name":"Rootkit","reference":"https://attack.mitre.org/techniques/T1014/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"tags:\"modules\" and event.action:\"loaded-kernel-module\" ","filters":[],"actions":[]}
{"id":"fa871e4d-b953-4c7e-a902-4ed78c97022d","updated_at":"2025-11-02T05:21:54.760Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.090Z","created_by":"elastic","name":"Configuration File Was Modified","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A configuration file was modified. Can safely ignore if this was done to harden the service","risk_score":65,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"102e99f1-1337-496b-80e4-7e7da3a2b0e3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.module:\"file_integrity\" and event.type:\"change\" and file.extension: (\"conf\" or \"cfg\" or \"yml\" or \"yaml\" or \"cnf\" or \"cf\" or \"ini\")","filters":[],"actions":[]}
{"id":"c0ecb63c-063a-4a33-9cc8-832ca43f6e5a","updated_at":"2025-11-02T05:21:54.765Z","updated_by":"elastic","created_at":"2025-11-02T03:48:12.802Z","created_by":"elastic","name":"User Account Was Unlocked","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A user account was unlocked and can be used again","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"bf5d1b38-6545-4019-a7ad-0d8c1bac30e0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"process.name:\"usermod\" and process.args:(\"--unlock\" or \"-U\")","filters":[],"actions":[]}
{"id":"516b871e-72d6-4f84-857f-b9a21b32bea9","updated_at":"2025-11-02T05:21:54.757Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.618Z","created_by":"elastic","name":"A User's Password Was Changed","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A user's password was changed. Make sure it was changed by the team","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"9a7ebeef-9a2d-494f-adf6-8c82b9fbb83f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.action:\"changed-password\" and event.outcome:\"success\"","filters":[],"actions":[]}
{"id":"2f5910dd-38d6-468a-92a0-6081877ed817","updated_at":"2025-11-02T05:21:54.744Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.641Z","created_by":"elastic","name":"A Command Was Run With Sudo","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"Someone ran a command with elevated privileges using sudo","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"1f186a65-a746-4bec-8eae-b74a8ef6bca3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.003","name":"Sudo and Sudo Caching","reference":"https://attack.mitre.org/techniques/T1548/003/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.category:\"process\" and process.name:\"sudo\" and event.outcome:\"success\" and tags:\"priv_esc\"","filters":[],"actions":[]}
{"id":"0d146571-2142-434c-b54e-af1da4ba66de","updated_at":"2025-11-02T05:21:54.746Z","updated_by":"elastic","created_at":"2025-11-02T03:48:13.095Z","created_by":"elastic","name":"Process was Stopped or Killed","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A process was sent a signal to stop or kill it. Could mean that a service was stopped/restarted. The process ID can be found at field auditd.data.a0 and the signal at auditd.data.a1. They are converted to hexadecimal, so simply convert back to an integer to get the values.\n\nSignals:\n3 - SIGQUIT\n6 - SIGABRT\n9 - SIGKILL\nf - SIGTERM\n13 - SIGSTOP","risk_score":25,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-21m","rule_id":"04ef05f3-127e-422f-ae5b-1dac07ec9ef5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"tags:\"signals\" and auditd.data.a1: (\"3\" or \"6\" or \"9\" or \"f\" or \"13\")","filters":[],"actions":[]}
{"id":"60acc831-3acc-457e-b825-c58594e6c8c5","updated_at":"2025-11-02T05:21:54.755Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.600Z","created_by":"elastic","name":"New User Added","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"A new user was added","risk_score":75,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"investigation_fields":{"field_names":["user.target.name","user.audit.name","user.name"]},"author":[],"false_positives":[],"from":"now-80s","rule_id":"32951f6f-c258-4f80-99d1-6d6871ffee6b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"auditd.message_type:\"add_user\" and event.outcome :\"success\" ","filters":[],"actions":[]}
{"id":"17babfb6-3573-4a90-9c89-1c544f950817","updated_at":"2025-11-02T05:21:54.767Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.650Z","created_by":"elastic","name":"A User Switched Users","tags":["OS: Linux"],"interval":"1m","enabled":true,"revision":1,"description":"Someone logged in as another user","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"7ced2cfb-41c8-4209-9f61-bf228d3da043","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"process.name:\"su\" and event.outcome:\"success\" and tags:\"priv_esc\"","filters":[],"actions":[]}
{"id":"a8db56f0-6fcc-4488-be81-a7d4fd2fe1f1","updated_at":"2025-11-02T05:23:00.404Z","updated_by":"elastic","created_at":"2025-11-02T04:12:56.407Z","created_by":"elastic","name":"User Attempted to Logon","tags":["OS: Windows"],"interval":"1m","enabled":true,"revision":2,"description":"A user attempted to logon remotely. Check if they succeeded or failed","risk_score":75,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"author":[],"false_positives":[],"from":"now-80s","rule_id":"032bfc38-0120-459d-bd4c-a93a1a89dae9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"(event.code: (\"4624\" or \"4625\") and winlog.event_data.LogonType: (\"3\" or \"10\")) or event.code: \"4778\"","filters":[],"actions":[]}
{"id":"fdf5055d-a3c8-4749-af22-277ab83e30ca","updated_at":"2025-11-02T05:21:54.752Z","updated_by":"elastic","created_at":"2025-11-02T03:48:11.626Z","created_by":"elastic","name":"User Login","tags":["login","OS: Linux"],"interval":"30s","enabled":true,"revision":1,"description":"A user successfully logged onto the machine","risk_score":25,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.1.90:5601/app/security"},"investigation_fields":{"field_names":["agent.hostname","user.name","source.ip"]},"author":[],"false_positives":[],"from":"now-40s","rule_id":"89d47860-c00d-441c-8f26-261ef9fed287","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[]}]}],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["auditbeat-*"],"query":"auditd.data.op:\"login\" and event.outcome:\"success\" ","filters":[],"actions":[]}
{"exported_count":16,"exported_rules_count":16,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
